import { builder, getBody, getQueryParameters } from '../util'
import Mock from 'mockjs'

const getAllAlarmTypeDataList = options => {
  console.log('getAllAlarmTypeDataList options', options)
  const queryParameters = getQueryParameters(options)
  console.log('getAllAlarmTypeDataList query', queryParameters)
  let data = [
    {
      id: 'aaaa111111',
      name: '机动车违停'
    },
    {
      id: 'bbbb111111',
      name: '沿街晾晒'
    }
  ]
  return builder(
    {
      code: 0,
      data: data,
      msg: '操作成功'
    },
    '请求成功',
    0,
    { 'Custom-Header': Mock.mock('@id') }
  )
}
Mock.mock(/\/@test\/getAllAlarmTypeDataList/, 'get', getAllAlarmTypeDataList)

const getAllAlarmDataList = options => {
  console.log('getAllAlarmDataList options', options)
  const queryParameters = getQueryParameters(options)
  console.log('getAllAlarmDataList query', queryParameters)
  let data = {
    list: [
      {
        id: 'aaaa111111',
        typeName: '沿街晾晒',
        dayTime: 1574729844000,
        position: '马山街3号',
        x: '120.196953',
        y: '30.278492',
        cameraName: '马山街3号监控',
        videoSrc:
          'rtmp://115.231.81.231:1935/service/PuId-ChannelNo=123724000100000015-01&PlayMethod=0&StreamingType=0&NetType=1&FCode=12',
        photoUrl: 'http://61.153.37.213:8087/camera/2019/11/18/20191118080357327335.jpg'
      },
      {
        id: 'bbbbb111111',
        typeName: '机动车违停',
        dayTime: 1574729844000,
        position: '杭州ssss市杭州市杭州杭州市杭州市杭州市ssssssssss市杭州市杭州市杭州',
        x: '120.196953',
        y: '30.278492',
        cameraName: '马山街3号监控',
        videoSrc:
          'rtmp://115.231.81.231:1935/service/PuId-ChannelNo=123724000100000883-01&PlayMethod=0&StreamingType=0&NetType=1&FCode=12',
        photoUrl: 'http://61.153.37.213:8087/camera/2019/11/18/20191118080357327335.jpg'
      },
      {
        id: 'cccccc11111111',
        typeName: '沿街晾晒',
        dayTime: 1574729844000,
        position:
          '马山街3号马山街3号监控马山街3号监控马山街3号监控马山街3号监控马山街3号监控马山街3号监控马山街3号监控马山街3号监控',
        x: '120.196953',
        y: '30.278492',
        cameraName: '马山街3号监控马山街3号监控',
        videoSrc:
          'rtmp://115.231.81.231:1935/service/PuId-ChannelNo=123724000100000005-01&PlayMethod=0&StreamingType=0&NetType=1&FCode=12',
        photoUrl: 'http://61.153.37.213:8087/camera/2019/11/18/20191118080357327335.jpg'
      },
      {
        id: 'dddd111111111',
        typeName: '沿街晾晒',
        dayTime: 1574729844000,
        position: '马山街3号',
        x: '120.196953',
        y: '30.278492',
        cameraName: '马山街3号监控',
        videoSrc:
          'rtmp://115.231.81.231:1935/service/PuId-ChannelNo=123724000100000134-01&PlayMethod=0&StreamingType=0&NetType=1&FCode=12',
        photoUrl: 'http://61.153.37.213:8087/camera/2019/11/18/20191118080357327335.jpg'
      },
      {
        id: 'eeee1111111',
        typeName: '沿街晾晒',
        dayTime: 1574729844000,
        position: '马山街3号',
        x: '120.196953',
        y: '30.278492',
        cameraName: '马山街3号监控',
        videoSrc:
          'rtmp://115.231.81.231:1935/service/PuId-ChannelNo=123724000100000219-01&PlayMethod=0&StreamingType=0&NetType=1&FCode=12',
        photoUrl: 'http://61.153.37.213:8087/camera/2019/11/18/20191118080357327335.jpg'
      }
    ],
    total: 5
  }
  return builder(
    {
      code: 0,
      data: data,
      msg: '操作成功'
    },
    '请求成功',
    0,
    { 'Custom-Header': Mock.mock('@id') }
  )
}
Mock.mock(/\/@test\/getAllAlarmDataList/, 'get', getAllAlarmDataList)

const alarmNormalHandle = options => {
  console.log('alarmNormalHandle options', options)
  const body = getBody(options)
  console.log('alarmNormalHandle body', body)
  let data = {
    msg: '操作成功'
  }
  return builder(
    {
      code: 0,
      data: data,
      msg: '操作成功'
    },
    '请求成功',
    0,
    { 'Custom-Header': Mock.mock('@id') }
  )
}
Mock.mock(/\/@test\/alarmNormalHandle/, 'post', alarmNormalHandle)

const alarmReportHandle = options => {
  console.log('alarmReportHandle options', options)
  const body = getBody(options)
  console.log('alarmReportHandle body', body)
  let data = {
    msg: '操作成功'
  }
  return builder(
    {
      code: 0,
      data: data,
      msg: '操作成功'
    },
    '请求成功',
    0,
    { 'Custom-Header': Mock.mock('@id') }
  )
}
Mock.mock(/\/@test\/alarmReportHandle/, 'post', alarmReportHandle)

const getAllCameraTreeData = options => {
  console.log('getAllCameraTreeData options', options)
  const queryParameters = getQueryParameters(options)
  console.log('getAllCameraTreeData query', queryParameters)
  let data = [
    {
      id: 'testStandardId',
      isLeaf: 'true',
      name: '监控摄像头',
      children: [
        {
          ip: '192.168.100.46',
          isLeaf: 'false',
          mpid: '33092104001320015992',
          mpname: '三江购物-球',
          puid: '33092104001320015992',
          typename: '高空瞭望',
          x: '30.247886',
          y: '122.202261'
        },
        {
          ip: '192.168.100.46',
          isLeaf: 'false',
          mpid: '33092104001320010677',
          mpname: '三江购物-全景',
          puid: '33092104001320010677',
          typename: '高空瞭望',
          x: '30.247886',
          y: '122.202261'
        },
        {
          ip: '192.168.100.55',
          isLeaf: 'false',
          mpid: '33092104001320015002',
          mpname: '新区广电大楼楼顶-球',
          puid: '33092104001320015002',
          typename: '高空瞭望',
          x: '30.265587',
          y: '122.218019'
        },
        {
          ip: '192.168.100.55',
          isLeaf: 'false',
          mpid: '33092104001320011649',
          mpname: '新区广电大楼楼顶-全景',
          puid: '33092104001320011649',
          typename: '高空瞭望',
          x: '30.265587',
          y: '122.218019'
        },
        {
          ip: '192.168.100.70',
          isLeaf: 'false',
          mpid: '33092104001320013870',
          mpname: '蓬莱公园铁塔-球',
          puid: '33092104001320013870',
          typename: '高空瞭望',
          x: '30.245140',
          y: '122.208213'
        },
        {
          ip: '192.168.100.70',
          isLeaf: 'false',
          mpid: '33092104001320017369',
          mpname: '蓬莱公园铁塔-全景',
          puid: '33092104001320017369',
          typename: '高空瞭望',
          x: '30.245140',
          y: '122.208213'
        },
        {
          ip: '192.168.100.77',
          isLeaf: 'false',
          mpid: '33092104001320010611',
          mpname: '交通大楼全景-球',
          puid: '33092104001320010611',
          typename: '高空瞭望',
          x: '30.252779',
          y: '122.220688'
        },
        {
          ip: '192.168.100.77',
          isLeaf: 'false',
          mpid: '33092104001320012341',
          mpname: '交通大楼全景',
          puid: '33092104001320012341',
          typename: '高空瞭望',
          x: '30.252779',
          y: '122.220688'
        },
        {
          ip: '192.168.110.2',
          isLeaf: 'false',
          mpid: '3309211001320012383',
          mpname: '无人机Camera 01',
          puid: '330921100',
          typename: '无人机',
          x: '30.245192',
          y: '122.206967'
        },
        {
          ip: '192.168.100.26',
          isLeaf: 'false',
          mpid: '33092104001320010656',
          mpname: '蓬莱路山外路路口-枪',
          puid: '33092104001320010656',
          typename: '老区监控',
          x: '30.240435',
          y: '122.203112'
        },
        {
          ip: '192.168.100.20',
          isLeaf: 'false',
          mpid: '33092104001320016924',
          mpname: '蓬莱路邮政银行门口-枪',
          puid: '33092104001320016924',
          typename: '老区监控',
          x: '30.247607',
          y: '122.202172'
        },
        {
          ip: '192.168.100.74',
          isLeaf: 'false',
          mpid: '33092104001320013662',
          mpname: '蓬莱路延伸段绿化带-枪1',
          puid: '33092104001320013662',
          typename: '老区监控',
          x: '30.252497',
          y: '122.201541'
        },
        {
          ip: '192.168.100.75',
          isLeaf: 'false',
          mpid: '33092104001320018885',
          mpname: '蓬莱路延伸段绿化带-枪2',
          puid: '33092104001320018885',
          typename: '老区监控',
          x: '30.252497',
          y: '122.201541'
        },
        {
          ip: '192.168.100.73',
          isLeaf: 'false',
          mpid: '33092104001320016549',
          mpname: '蓬莱路延伸段绿化带-球',
          puid: '33092104001320016549',
          typename: '老区监控',
          x: '30.252497',
          y: '122.201541'
        },
        {
          ip: '192.168.100.22',
          isLeaf: 'false',
          mpid: '33092104001320015586',
          mpname: '新河路与虹采路路口-球',
          puid: '33092104001320015586',
          typename: '老区监控',
          x: '30.249877',
          y: '122.199427'
        },
        {
          ip: '192.168.100.21',
          isLeaf: 'false',
          mpid: '33092104001320011228',
          mpname: '新河路与虹采路路口-枪',
          puid: '33092104001320011228',
          typename: '老区监控',
          x: '30.249877',
          y: '122.199427'
        },
        {
          ip: '192.168.100.25',
          isLeaf: 'false',
          mpid: '33092104001320012068',
          mpname: '长河路梅地亚宾馆口-枪',
          puid: '33092104001320012068',
          typename: '老区监控',
          x: '30.247042',
          y: '122.196388'
        },
        {
          ip: '192.168.100.19',
          isLeaf: 'false',
          mpid: '33092104001320017996',
          mpname: '长河路育才路路口-球',
          puid: '33092104001320017996',
          typename: '老区监控',
          x: '30.248168',
          y: '122.197457'
        },
        {
          ip: '192.168.100.76',
          isLeaf: 'false',
          mpid: '33092104001320017022',
          mpname: '长河路图书馆楼顶',
          puid: '33092104001320017022',
          typename: '老区监控',
          x: '30.249334',
          y: '122.200670'
        },
        {
          ip: '192.168.100.16',
          isLeaf: 'false',
          mpid: '33092104001320015689',
          mpname: '长河路五叉路口-枪1',
          puid: '33092104001320015689',
          typename: '老区监控',
          x: '30.248119',
          y: '122.201928'
        },
        {
          ip: '192.168.100.17',
          isLeaf: 'false',
          mpid: '33092104001320010524',
          mpname: '长河路五叉路口-枪2',
          puid: '33092104001320010524',
          typename: '老区监控',
          x: '30.248119',
          y: '122.201928'
        },
        {
          ip: '192.168.100.18',
          isLeaf: 'false',
          mpid: '33092104001320010947',
          mpname: '长河路五叉路口-枪3',
          puid: '33092104001320010947',
          typename: '老区监控',
          x: '30.248119',
          y: '122.201928'
        },
        {
          ip: '192.168.100.44',
          isLeaf: 'false',
          mpid: '33092104001320015224',
          mpname: '长河路康嘉路路口-球',
          puid: '33092104001320015224',
          typename: '老区监控',
          x: '30.24911',
          y: '122.20647'
        },
        {
          ip: '192.168.100.12',
          isLeaf: 'false',
          mpid: '33092104001320013605',
          mpname: '长河路康健路路口-球',
          puid: '33092104001320013605',
          typename: '老区监控',
          x: '30.248482',
          y: '122.204192'
        },
        {
          ip: '192.168.100.13',
          isLeaf: 'false',
          mpid: '33092104001320015199',
          mpname: '康嘉路-嘉和幼儿园对面-球',
          puid: '33092104001320015199',
          typename: '老区监控',
          x: '30.249963',
          y: '122.205757'
        },
        {
          ip: '192.168.100.14',
          isLeaf: 'false',
          mpid: '33092104001320015004',
          mpname: '康嘉路虹采路路口-球',
          puid: '33092104001320015004',
          typename: '老区监控',
          x: '30.249987',
          y: '122.203774'
        },
        {
          ip: '192.168.100.99',
          isLeaf: 'false',
          mpid: '33092104001320015469',
          mpname: '人民路邮电支路路口-球',
          puid: '33092104001320015469',
          typename: '老区监控',
          x: '30.243885',
          y: '122.198980'
        },
        {
          ip: '192.168.100.27',
          isLeaf: 'false',
          mpid: '33092104001320012507',
          mpname: '人民路人民支路路口-球',
          puid: '33092104001320012507',
          typename: '老区监控',
          x: '30.245374',
          y: '122.200464'
        },
        {
          ip: '192.168.100.84',
          isLeaf: 'false',
          mpid: '33092104001320017029',
          mpname: '三和美食城-球',
          puid: '33092104001320017029',
          typename: '老区监控',
          x: '30.246416',
          y: '122.202060'
        },
        {
          ip: '192.168.100.83',
          isLeaf: 'false',
          mpid: '33092104001320011301',
          mpname: '三和美食城枪1',
          puid: '33092104001320011301',
          typename: '老区监控',
          x: '30.246416',
          y: '122.202060'
        },
        {
          ip: '192.168.100.85',
          isLeaf: 'false',
          mpid: '33092104001320013611',
          mpname: '三和美食城枪2',
          puid: '33092104001320013611',
          typename: '老区监控',
          x: '30.246416',
          y: '122.202060'
        },
        {
          ip: '192.168.100.82',
          isLeaf: 'false',
          mpid: '33092104001320010826',
          mpname: '三和美食城枪3',
          puid: '33092104001320010826',
          typename: '老区监控',
          x: '30.246416',
          y: '122.202060'
        },
        {
          ip: '192.168.100.15',
          isLeaf: 'false',
          mpid: '33092104001320015174',
          mpname: '人民路红领巾路路口-球',
          puid: '33092104001320015174',
          typename: '老区监控',
          x: '30.246564',
          y: '122.204286'
        },
        {
          ip: '192.168.100.81',
          isLeaf: 'false',
          mpid: '33092104001320018675',
          mpname: '人民路红领巾路路口-枪',
          puid: '33092104001320018675',
          typename: '老区监控',
          x: '30.246564',
          y: '122.204254'
        },
        {
          ip: '192.168.100.86',
          isLeaf: 'false',
          mpid: '33092104001320010885',
          mpname: '高亭小学门口-枪机',
          puid: '33092104001320010885',
          typename: '老区监控',
          x: '30.245322',
          y: '122.205573'
        },
        {
          ip: '192.168.100.79',
          isLeaf: 'false',
          mpid: '33092104001320011216',
          mpname: '新菜场-球',
          puid: '33092104001320011216',
          typename: '老区监控',
          x: '30.247696',
          y: '122.209701'
        },
        {
          ip: '192.168.100.78',
          isLeaf: 'false',
          mpid: '33092104001320017493',
          mpname: '新菜场-枪东面',
          puid: '33092104001320017493',
          typename: '老区监控',
          x: '30.247696',
          y: '122.209701'
        },
        {
          ip: '192.168.100.80',
          isLeaf: 'false',
          mpid: '33092104001320019585',
          mpname: '新菜场-枪北面',
          puid: '33092104001320019585',
          typename: '老区监控',
          x: '30.247696',
          y: '122.209701'
        },
        {
          ip: '192.168.100.30',
          isLeaf: 'false',
          mpid: '33092104001320011976',
          mpname: '闸口菜场南门口-球',
          puid: '33092104001320011976',
          typename: '老区监控',
          x: '30.249379',
          y: '122.188973'
        },
        {
          ip: '192.168.100.51',
          isLeaf: 'false',
          mpid: '33092104001320012698',
          mpname: '蓬莱商都2楼-球',
          puid: '33092104001320012698',
          typename: '老区监控',
          x: '30.24623',
          y: '122.19923'
        },
        {
          ip: '192.168.100.28',
          isLeaf: 'false',
          mpid: '33092104001320012327',
          mpname: '闸口电影院对面-枪1',
          puid: '33092104001320012327',
          typename: '老区监控',
          x: '30.24805',
          y: '122.191767'
        },
        {
          ip: '192.168.100.29',
          isLeaf: 'false',
          mpid: '33092104001320013724',
          mpname: '闸口电影院对面-枪2',
          puid: '33092104001320013724',
          typename: '老区监控',
          x: '30.24805',
          y: '122.191767'
        },
        {
          ip: '192.168.100.42',
          isLeaf: 'false',
          mpid: '33092104001320015795',
          mpname: '沿港西路与闸口路路口-枪1',
          puid: '33092104001320015795',
          typename: '老区监控',
          x: '30.246942',
          y: '122.194228'
        },
        {
          ip: '192.168.100.43',
          isLeaf: 'false',
          mpid: '33092104001320013141',
          mpname: '沿港西路与闸口路路口-枪2',
          puid: '33092104001320013141',
          typename: '老区监控',
          x: '30.246942',
          y: '122.194228'
        },
        {
          ip: '192.168.100.23',
          isLeaf: 'false',
          mpid: '33092104001320016167',
          mpname: '沿港中路翡翠岛路口-球',
          puid: '33092104001320016167',
          typename: '老区监控',
          x: '30.244753',
          y: '122.196255'
        },
        {
          ip: '192.168.100.24',
          isLeaf: 'false',
          mpid: '33092104001320014010',
          mpname: '沿港中路滨港路路口-球',
          puid: '33092104001320014010',
          typename: '老区监控',
          x: '30.2438',
          y: '122.196365'
        },
        {
          ip: '192.168.100.38',
          isLeaf: 'false',
          mpid: '33092104001320012277',
          mpname: '滨港中路清泰路路口-枪1',
          puid: '33092104001320012277',
          typename: '老区监控',
          x: '30.24169',
          y: '122.198935'
        },
        {
          ip: '192.168.100.39',
          isLeaf: 'false',
          mpid: '33092104001320011707',
          mpname: '滨港中路清泰路路口-枪2',
          puid: '33092104001320011707',
          typename: '老区监控',
          x: '30.24169',
          y: '122.198935'
        },
        {
          ip: '192.168.100.48',
          isLeaf: 'false',
          mpid: '33092104001320018426',
          mpname: '蓬莱商都2楼-枪1',
          puid: '33092104001320018426',
          typename: '老区监控',
          x: '30.24623',
          y: '122.19923'
        },
        {
          ip: '192.168.100.50',
          isLeaf: 'false',
          mpid: '33092104001320017411',
          mpname: '蓬莱商都2楼-枪2',
          puid: '33092104001320017411',
          typename: '老区监控',
          x: '30.24623',
          y: '122.19923'
        },
        {
          ip: '192.168.100.49',
          isLeaf: 'false',
          mpid: '33092104001320018568',
          mpname: '蓬莱路蓬园路路口-球',
          puid: '33092104001320018568',
          typename: '老区监控',
          x: '30.24378',
          y: '122.20229'
        },
        {
          ip: '192.168.100.66',
          isLeaf: 'false',
          mpid: '33092104001320012810',
          mpname: '安澜路东路口',
          puid: '33092104001320012810',
          typename: '老区监控',
          x: '30.248123',
          y: '122.201657'
        },
        {
          ip: '192.168.100.45',
          isLeaf: 'false',
          mpid: '33092104001320017883',
          mpname: '育才路园丁路路口-枪',
          puid: '33092104001320017883',
          typename: '老区监控',
          x: '30.25136',
          y: '122.19668'
        },
        {
          ip: '192.168.100.64',
          isLeaf: 'false',
          mpid: '33092104001320013562',
          mpname: '城管停车场',
          puid: '33092104001320013562',
          typename: '老区监控',
          x: '30.24556',
          y: '122.20702'
        },
        {
          ip: '192.168.100.1',
          isLeaf: 'false',
          mpid: '33092104001320012103',
          mpname: '海德花园与杨帆路口-球',
          puid: '33092104001320012103',
          typename: '新区监控',
          x: '30.259534',
          y: '122.217502'
        },
        {
          ip: '192.168.100.98',
          isLeaf: 'false',
          mpid: '33092104001320017482',
          mpname: '竹屿菜场-球',
          puid: '33092104001320017482',
          typename: '新区监控',
          x: '30.253063',
          y: '122.216299'
        },
        {
          ip: '192.168.100.97',
          isLeaf: 'false',
          mpid: '33092104001320015184',
          mpname: '竹屿菜场-枪',
          puid: '33092104001320015184',
          typename: '新区监控',
          x: '30.253063',
          y: '122.216299'
        },
        {
          ip: '192.168.100.90',
          isLeaf: 'false',
          mpid: '33092104001320016314',
          mpname: '浪琴南门口小公园-球',
          puid: '33092104001320016314',
          typename: '新区监控',
          x: '30.253533',
          y: '122.215248'
        },
        {
          ip: '192.168.100.89',
          isLeaf: 'false',
          mpid: '33092104001320015692',
          mpname: '浪琴南门口小公园-枪',
          puid: '33092104001320015692',
          typename: '新区监控',
          x: '30.253533',
          y: '122.215248'
        },
        {
          ip: '192.168.100.40',
          isLeaf: 'false',
          mpid: '33092104001320017822',
          mpname: '浪琴东门口-球',
          puid: '33092104001320017822',
          typename: '新区监控',
          x: '30.254946',
          y: '122.215684'
        },
        {
          ip: '192.168.100.41',
          isLeaf: 'false',
          mpid: '33092104001320014293',
          mpname: '浪琴东门口-枪',
          puid: '33092104001320014293',
          typename: '新区监控',
          x: '30.254946',
          y: '122.215684'
        },
        {
          ip: '192.168.100.71',
          isLeaf: 'false',
          mpid: '33092104001320015345',
          mpname: '华枫西门-球',
          puid: '33092104001320015345',
          typename: '新区监控',
          x: '30.25514',
          y: '122.21582'
        },
        {
          ip: '192.168.100.72',
          isLeaf: 'false',
          mpid: '33092104001320015801',
          mpname: '华枫西门-枪',
          puid: '33092104001320015801',
          typename: '新区监控',
          x: '30.25514',
          y: '122.21582'
        },
        {
          ip: '192.168.100.4',
          isLeaf: 'false',
          mpid: '33092104001320013277',
          mpname: '华枫小区-兰秀与钓海路岔路口-球',
          puid: '33092104001320013277',
          typename: '新区监控',
          x: '30.256373',
          y: '122.216568'
        },
        {
          ip: '192.168.100.3',
          isLeaf: 'false',
          mpid: '33092104001320017440',
          mpname: '华枫小区-兰秀与钓海路岔路口-枪',
          puid: '33092104001320017440',
          typename: '新区监控',
          x: '30.256373',
          y: '122.21645'
        },
        {
          ip: '192.168.100.36',
          isLeaf: 'false',
          mpid: '33092104001320019884',
          mpname: '半岛城市花园东门口-球',
          puid: '33092104001320019884',
          typename: '新区监控',
          x: '30.258245',
          y: '122.216760'
        },
        {
          ip: '192.168.100.35',
          isLeaf: 'false',
          mpid: '33092104001320013684',
          mpname: '半岛城市花园东门口-枪',
          puid: '33092104001320013684',
          typename: '新区监控',
          x: '30.258245',
          y: '122.216760'
        },
        {
          ip: '192.168.100.8',
          isLeaf: 'false',
          mpid: '33092104001320018998',
          mpname: '海德花园西门口-球',
          puid: '33092104001320018998',
          typename: '新区监控',
          x: '30.258221',
          y: '122.217085'
        },
        {
          ip: '192.168.100.7',
          isLeaf: 'false',
          mpid: '33092104001320012761',
          mpname: '海德花园西门口-枪',
          puid: '33092104001320012761',
          typename: '新区监控',
          x: '30.258221',
          y: '122.217085'
        },
        {
          ip: '192.168.100.2',
          isLeaf: 'false',
          mpid: '33092104001320012811',
          mpname: '海德花园与杨帆路口-枪',
          puid: '33092104001320012811',
          typename: '新区监控',
          x: '30.259534',
          y: '122.217502'
        },
        {
          ip: '192.168.100.31',
          isLeaf: 'false',
          mpid: '33092104001320018077',
          mpname: '太阳城1区东门口-球',
          puid: '33092104001320018077',
          typename: '新区监控',
          x: '30.261347',
          y: '122.217708'
        },
        {
          ip: '192.168.100.32',
          isLeaf: 'false',
          mpid: '33092104001320017119',
          mpname: '太阳城1区东门口-枪',
          puid: '33092104001320017119',
          typename: '新区监控',
          x: '30.261347',
          y: '122.217708'
        },
        {
          ip: '192.168.100.34',
          isLeaf: 'false',
          mpid: '33092104001320013746',
          mpname: '太阳城2区西门口-球',
          puid: '33092104001320013746',
          typename: '新区监控',
          x: '30.261002',
          y: '122.217708'
        },
        {
          ip: '192.168.100.33',
          isLeaf: 'false',
          mpid: '33092104001320016611',
          mpname: '太阳城2区西门口-枪',
          puid: '33092104001320016611',
          typename: '新区监控',
          x: '30.261002',
          y: '122.217708'
        },
        {
          ip: '192.168.100.6',
          isLeaf: 'false',
          mpid: '33092104001320014126',
          mpname: '半岛城市花园南门口-球',
          puid: '33092104001320014126',
          typename: '新区监控',
          x: '30.258245',
          y: '122.216760'
        },
        {
          ip: '192.168.100.5',
          isLeaf: 'false',
          mpid: '33092104001320013797',
          mpname: '半岛城市花园南门口-枪',
          puid: '33092104001320013797',
          typename: '新区监控',
          x: '30.256885',
          y: '122.215404'
        },
        {
          ip: '192.168.100.10',
          isLeaf: 'false',
          mpid: '33092104001320018719',
          mpname: '海德花园南门口-球',
          puid: '33092104001320018719',
          typename: '新区监控',
          x: '30.259306',
          y: '122.220138'
        },
        {
          ip: '192.168.100.9',
          isLeaf: 'false',
          mpid: '33092104001320018799',
          mpname: '海德花园南门口-枪',
          puid: '33092104001320018799',
          typename: '新区监控',
          x: '30.259306',
          y: '122.220138'
        },
        {
          ip: '192.168.100.87',
          isLeaf: 'false',
          mpid: '33092104001320019516',
          mpname: '华枫花园北门口-球',
          puid: '33092104001320019516',
          typename: '新区监控',
          x: '30.256429',
          y: '122.217232'
        },
        {
          ip: '192.168.100.88',
          isLeaf: 'false',
          mpid: '33092104001320011690',
          mpname: '华枫花园北门口-枪',
          puid: '33092104001320011690',
          typename: '新区监控',
          x: '30.256429',
          y: '122.217232'
        },
        {
          ip: '192.168.100.11',
          isLeaf: 'false',
          mpid: '33092104001320010108',
          mpname: '浪琴花西门口-衢山大道-球',
          puid: '33092104001320010108',
          typename: '新区监控',
          x: '30.255125',
          y: '122.213026'
        },
        {
          ip: '192.168.100.52',
          isLeaf: 'false',
          mpid: '33092104001320011736',
          mpname: '鱼山大道实验学校北门-枪',
          puid: '33092104001320011736',
          typename: '新区监控',
          x: '30.25007',
          y: '122.22087'
        },
        {
          ip: '192.168.100.101',
          isLeaf: 'false',
          mpid: '33092104001320012183',
          mpname: '竹屿汽车站出口-球',
          puid: '33092104001320012183',
          typename: '新区监控',
          x: '30.257347',
          y: '122.213480'
        },
        {
          ip: '192.168.100.100',
          isLeaf: 'false',
          mpid: '33092104001320019866',
          mpname: '竹屿汽车站出口-枪',
          puid: '33092104001320019866',
          typename: '新区监控',
          x: '30.257347',
          y: '122.213480'
        },
        {
          ip: '192.168.100.54',
          isLeaf: 'false',
          mpid: '33092104001320014413',
          mpname: '仙洲公园-球',
          puid: '33092104001320014413',
          typename: '公园广场',
          x: '30.23900',
          y: '122.20000'
        },
        {
          ip: '192.168.100.57',
          isLeaf: 'false',
          mpid: '33092104001320010785',
          mpname: '行政广场2',
          puid: '33092104001320010785',
          typename: '公园广场',
          x: '30.26533',
          y: '122.22273'
        },
        {
          ip: '192.168.100.58',
          isLeaf: 'false',
          mpid: '33092104001320015240',
          mpname: '行政广场1',
          puid: '33092104001320015240',
          typename: '公园广场',
          x: '30.26533',
          y: '122.22273'
        },
        {
          ip: '192.168.100.59',
          isLeaf: 'false',
          mpid: '33092104001320018257',
          mpname: '儿童公园2',
          puid: '33092104001320018257',
          typename: '公园广场',
          x: '30.24666',
          y: '122.20796'
        },
        {
          ip: '192.168.100.60',
          isLeaf: 'false',
          mpid: '33092104001320018913',
          mpname: '儿童公园1',
          puid: '33092104001320018913',
          typename: '公园广场',
          x: '30.24666',
          y: '122.20796'
        },
        {
          ip: '192.168.100.62',
          isLeaf: 'false',
          mpid: '33092104001320018211',
          mpname: '湿地公园1',
          puid: '33092104001320018211',
          typename: '公园广场',
          x: '30.26851',
          y: '122.21941'
        },
        {
          ip: '192.168.100.63',
          isLeaf: 'false',
          mpid: '33092104001320017081',
          mpname: '湿地公园2',
          puid: '33092104001320017081',
          typename: '公园广场',
          x: '30.26851',
          y: '122.21941'
        },
        {
          ip: '192.168.100.65',
          isLeaf: 'false',
          mpid: '33092104001320018382',
          mpname: '行政广场3',
          puid: '33092104001320018382',
          typename: '公园广场',
          x: '30.26533',
          y: '122.22273'
        },
        {
          ip: '192.168.100.68',
          isLeaf: 'false',
          mpid: '33092104001320018529',
          mpname: '新婚林-枪1',
          puid: '33092104001320018529',
          typename: '公园广场',
          x: '30.26064',
          y: '122.22275'
        },
        {
          ip: '192.168.100.69',
          isLeaf: 'false',
          mpid: '33092104001320019661',
          mpname: '新婚林-枪2',
          puid: '33092104001320019661',
          typename: '公园广场',
          x: '30.26064',
          y: '122.22275'
        },
        {
          ip: '192.168.100.37',
          isLeaf: 'false',
          mpid: '33092104001320017852',
          mpname: '衢山大道长河路路口-枪',
          puid: '33092104001320017852',
          typename: '公园广场',
          x: '30.252715',
          y: '122.214368'
        },
        {
          ip: '192.168.100.47',
          isLeaf: 'false',
          mpid: '33092104001320017348',
          mpname: '峰景湾-枪',
          puid: '33092104001320017348',
          typename: '桥梁监控',
          x: '30.24024',
          y: '122.21054'
        },
        {
          ip: '192.168.100.53',
          isLeaf: 'false',
          mpid: '33092104001320013827',
          mpname: '小蒲门铁桥-球',
          puid: '33092104001320013827',
          typename: '桥梁监控',
          x: '30.24021',
          y: '122.21106'
        },
        {
          ip: '192.168.100.61',
          isLeaf: 'false',
          mpid: '33092104001320012752',
          mpname: '仙洲桥',
          puid: '33092104001320012752',
          typename: '桥梁监控',
          x: '30.24056',
          y: '122.19876'
        },
        {
          ip: '192.168.100.56',
          isLeaf: 'false',
          mpid: '33092104001320019170',
          mpname: '浪激咀封闭场-大门',
          puid: '33092104001320019170',
          typename: '环卫所中转站',
          x: '30.26106',
          y: '122.17289'
        },
        {
          ip: '192.168.100.67',
          isLeaf: 'false',
          mpid: '33092104001320010568',
          mpname: '泥峙填埋场2',
          puid: '33092104001320010568',
          typename: '环卫所中转站',
          x: '30.33398',
          y: '122.18707'
        },
        {
          ip: '192.168.100.96',
          isLeaf: 'false',
          mpid: '33092104001320019315',
          mpname: '新城环卫中转站-修理车间',
          puid: '33092104001320019315',
          typename: '环卫所中转站',
          x: '30.262840',
          y: '122.213293'
        },
        {
          ip: '192.168.100.96',
          isLeaf: 'false',
          mpid: '33092104001320012466',
          mpname: '新城环卫中转站-广场',
          puid: '33092104001320012466',
          typename: '环卫所中转站',
          x: '30.262840',
          y: '122.213293'
        },
        {
          ip: '192.168.100.96',
          isLeaf: 'false',
          mpid: '33092104001320010115',
          mpname: '新城环卫中转站-大门',
          puid: '33092104001320010115',
          typename: '环卫所中转站',
          x: '30.262840',
          y: '122.213293'
        },
        {
          ip: '192.168.100.96',
          isLeaf: 'false',
          mpid: '33092104001320014859',
          mpname: '新城环卫中转站-仓库',
          puid: '33092104001320014859',
          typename: '环卫所中转站',
          x: '30.262840',
          y: '122.213293'
        },
        {
          ip: '192.168.100.96',
          isLeaf: 'false',
          mpid: '33092104001320016029',
          mpname: '新城环卫中转站-修理车间',
          puid: '33092104001320016029',
          typename: '环卫所中转站',
          x: '30.262840',
          y: '122.213293'
        },
        {
          ip: '192.168.110.2',
          isLeaf: 'false',
          mpid: 'D240358741320015848',
          mpname: '浙L.L9217',
          puid: 'D24035870',
          typename: '车载卡口',
          x: '30.240111',
          y: '122.199586'
        },
        {
          ip: '192.168.110.6',
          isLeaf: 'false',
          mpid: 'D240358701320018075',
          mpname: '浙L.M5223',
          puid: 'D24035874',
          typename: '车载卡口',
          x: '30.245608',
          y: '122.206675'
        },
        {
          ip: '192.168.110.5',
          isLeaf: 'false',
          mpid: 'D240358761320017570',
          mpname: '浙L.M5251',
          puid: 'D24035876',
          typename: '车载卡口',
          x: '30.245642',
          y: '122.206689'
        },
        {
          ip: '192.168.110.11',
          isLeaf: 'false',
          mpid: 'D230524341320017391',
          mpname: '浙L.L9217车头',
          puid: 'D23052434',
          typename: '车载监控',
          x: '30.245575',
          y: '122.206636'
        },
        {
          ip: '192.168.110.11',
          isLeaf: 'false',
          mpid: 'D230524341320016898',
          mpname: '浙L.L9217前排',
          puid: 'D23052434',
          typename: '车载监控',
          x: '30.245575',
          y: '122.206636'
        },
        {
          ip: '192.168.110.11',
          isLeaf: 'false',
          mpid: 'D230524341320013278',
          mpname: '浙L.L9217后排',
          puid: 'D23052434',
          typename: '车载监控',
          x: '30.245575',
          y: '122.206636'
        },
        {
          ip: '192.168.110.7',
          isLeaf: 'false',
          mpid: '3309020011320018525',
          mpname: '赵良',
          puid: '330902001',
          typename: '单兵',
          x: '30.246917',
          y: '122.205664'
        },
        {
          ip: '192.168.110.24',
          isLeaf: 'false',
          mpid: '3309020021320019394',
          mpname: '黄思维',
          puid: '330902002',
          typename: '单兵',
          x: '30.247736',
          y: '122.206769'
        },
        {
          ip: '192.168.110.23',
          isLeaf: 'false',
          mpid: '3309020031320017796',
          mpname: '王坚学',
          puid: '330902003',
          typename: '单兵',
          x: '30.246003',
          y: '122.207142'
        },
        {
          ip: '192.168.110.22',
          isLeaf: 'false',
          mpid: '3309020051320011753',
          mpname: '林志杰',
          puid: '330902004',
          typename: '单兵',
          x: '30.248222',
          y: '122.2055'
        },
        {
          ip: '192.168.110.25',
          isLeaf: 'false',
          mpid: '3309020041320016469',
          mpname: '郑波',
          puid: '330902005',
          typename: '单兵',
          x: '30.248319',
          y: '122.205533'
        },
        {
          ip: '192.168.110.97',
          isLeaf: 'false',
          mpid: '3309020061320015317',
          mpname: '童迪',
          puid: '330902006',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.98',
          isLeaf: 'false',
          mpid: '3309020071320019189',
          mpname: '徐华',
          puid: '330902007',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.99',
          isLeaf: 'false',
          mpid: '3309020081320018194',
          mpname: '王凯杰',
          puid: '330902008',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.100',
          isLeaf: 'false',
          mpid: '3309020091320010564',
          mpname: '岑维迪',
          puid: '330902009',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.101',
          isLeaf: 'false',
          mpid: '3309020101320017336',
          mpname: '汪宏伟',
          puid: '330902010',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.102',
          isLeaf: 'false',
          mpid: '3309020111320016054',
          mpname: '张峰夜间',
          puid: '330902011',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.103',
          isLeaf: 'false',
          mpid: '3309020121320011888',
          mpname: '傅建民',
          puid: '330902012',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.104',
          isLeaf: 'false',
          mpid: '3309020131320014211',
          mpname: '张峰城南',
          puid: '330902013',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.106',
          isLeaf: 'false',
          mpid: '3309020141320015492',
          mpname: '黄群华',
          puid: '330902014',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.95',
          isLeaf: 'false',
          mpid: '3309020151320019742',
          mpname: '王挺',
          puid: '330902015',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.94',
          isLeaf: 'false',
          mpid: '3309020161320014519',
          mpname: '陈金陵',
          puid: '330902016',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.93',
          isLeaf: 'false',
          mpid: '3309020171320018338',
          mpname: '郑明',
          puid: '330902017',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.92',
          isLeaf: 'false',
          mpid: '3309020181320010862',
          mpname: '张军',
          puid: '330902018',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.91',
          isLeaf: 'false',
          mpid: '3309020191320018814',
          mpname: '金建杰',
          puid: '330902019',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.90',
          isLeaf: 'false',
          mpid: '3309020201320010569',
          mpname: '梅书伟',
          puid: '330902020',
          typename: '单兵',
          x: '',
          y: ''
        },
        {
          ip: '192.168.110.9',
          isLeaf: 'false',
          mpid: '3309021001320013791',
          mpname: '布控球',
          puid: '3309021001320013791',
          typename: '布控球',
          x: '30.245398',
          y: '122.206825'
        }
      ]
    }
  ]

  return builder(
    {
      code: 0,
      data: data,
      msg: '操作成功'
    },
    '请求成功',
    0,
    { 'Custom-Header': Mock.mock('@id') }
  )
}
Mock.mock(/\/@test\/getAllCameraTreeData/, 'get', getAllCameraTreeData)
